import { swap } from "./util";
import { expect } from '@jest/globals';

describe('Тест алгоритма разворота строки:', () => {
  it('Строка с чётным количеством символов', () => {
    expect(swap('тест')).toEqual(['т','с','е','т']);
  });

  it('Строка с нечётным количеством символов', () => {
    expect(swap('практикум')).toEqual(['м','у','к','и','т','к','а','р','п']);
  });

  it('Строка с одним символом', () => {
    expect(swap('a')).toEqual(['a']);
  });

  it('Пустая строка', () => {
    expect(swap('')).toEqual([]);
  });
});
